{"criterion": "card_delivery_delay", "description": "The text expresses concern or inquiry about a card that has not yet arrived, is delayed, or is taking longer than expected to be delivered. The user may mention waiting for a card, not having received a card after a certain period, asking about the status or tracking of a card delivery, or wondering if the card is lost. Phrases like 'still waiting', 'has not arrived', 'when will I get my card', 'track my card', or 'card delivery' are common. The focus is on the physical delivery or shipment of a card, not on activation or linking in an app.", "class": "11"}
{"criterion": "card_tracking_request", "description": "The text specifically asks about tracking information for a card that has been sent or ordered. The user may request a tracking number, ask if tracking is available, or inquire about how to track the card's shipment. The intent is to obtain information about the shipment's progress or location, not about activating or linking the card.", "class": "11"}
{"criterion": "card_linking_or_activation", "description": "The text is about adding, linking, or reactivating a card within an app or account. The user may mention that they have received a card and want to add it to the app, cannot see the card in the app, want to re-add or reactivate a card, or are asking how to link an existing card. Phrases like 'add the card to my account', 'link the new card', 'reactivate my card', or 'put it in the app' are common. The focus is on digital association or activation of a card, not on its physical delivery.", "class": "13"}
{"criterion": "card_delivery_time_request", "description": "The text is primarily concerned with how long it will take for a card to be delivered. The user may ask about estimated delivery dates, delivery speeds, standard versus express delivery, or whether they can choose a specific delivery date. There is a focus on expected or desired arrival times, urgency of delivery, or the possibility of expedited shipping. The intent is to obtain information about delivery timing, not to report a missing, delayed, or lost card.", "class": "12"}
{"criterion": "card_delivery_location_request", "description": "The text asks about whether card delivery is available to a specific location or country, such as outside the UK, in the US, Europe, or China. The user may mention their country of residence and inquire about the possibility or procedure for receiving a card there. The intent is to clarify geographic eligibility for card delivery, not to report a missing card or ask about the status of an existing delivery.", "class": "24"}
{"criterion": "card_physical_vs_virtual_request", "description": "The text is about obtaining a physical (non-virtual) card, the process for ordering one, fees associated with physical cards, or delivery locations for physical cards. The user may compare physical and virtual cards, express a desire for a tangible card for in-person use, or ask how to receive or activate a physical card. The focus is on requesting or understanding physical card issuance, not delivery problems or digital activation.", "class": "43"}
{"criterion": "card_replacement_due_to_expiry", "description": "The text is about the process, timing, or cost of obtaining a replacement card when the current card is expiring or has expired. The user may mention the expiration date, ask what to do when their card expires, inquire about automatic renewal, or request delivery of a new card to a specific location. The focus is on replacing an expiring card, not on issues of loss, theft, or delivery delays.", "class": "9"}
